if OS.mac?
  # Taps
  tap 'homebrew/cask'
  tap 'superfly/tap'
  # tap 'homebrew/cask-fonts'

  brew "trash" # rm, but faster since it goes in the trash
  brew "dockutil" # https://github.com/kcrawford/dockutil

  # Apps
  cask "kitty" # better terminal
  cask "imageoptim" # image optimization tool
  cask "hammerspoon" # automation https://www.hammerspoon.org/

  # Fonts
  # cask "font-iosevka"
  # cask "font-3270-nerd-font"

elsif OS.linux?
  brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

brew "bat" # cat replacement https://github.com/sharkdp/bat

# Bit: Modern Git CLI
# https://github.com/chriswalz/bit#how-to-install
brew "bit-git"
brew "curl"
brew "exa" # ls replacement https://github.com/ogham/exa
brew "fzf" # fuzzy-finder https://github.com/junegunn/fzf
brew "fd" # Modern find https://github.com/sharkdp/fd
brew "gh" # Github CLI https://github.com/cli/cli
brew "git" # latest

# diff syntax highlighter https://github.com/dandavison/delta#installation
brew "git-delta"
brew "heroku/brew/heroku"
brew "jq" #jq shell scripts

# The lazier way to manage everything docker
# https://github.com/jesseduffield/lazydocker
brew "lazydocker"

brew "lazygit" # https://github.com/jesseduffield/lazygit
brew "mas" # Mac automation https://github.com/mas-cli/mas
brew "neovim" # better vim

# https://github.com/madler/pigz
# tar replacement (used inside prezto/archive)
brew "pigz"
brew "python" # latest

brew "redis"
brew "ripgrep" # Modern grep https://github.com/BurntSushi/ripgrep
brew "fnm" # fast node manager
brew "shellcheck" # https://github.com/koalaman/shellcheck
brew "superfly/tap/flyctl" # https://github.com/superfly/fly

brew "sd" # Modern sed https://github.com/chmln/sd

# Simplified and community-driven man pages
# https://github.com/tldr-pages/tldr
# brew "tldr" use global npm package
brew "tmux"
brew "trash"
brew "tree"

brew "wget"
brew "wifi-password"
brew "youtube-dl"
brew "zoxide" # Modern z https://github.com/ajeetdsouza/zoxide
brew "zsh"

## Casks - actual visual software

cask "alfred"
cask "brave-browser"
cask "charles"
cask "chromium"
cask "discord"
cask "firefox"
cask "focus"
cask "flux"
cask "licecap"
cask "notion"
cask "polymail"
cask "postico"
cask "postman"
cask "sublime-text"
cask "spotify"
cask "visual-studio-code"
cask "zoom"

# Mac App Store Installations
mas "Numbers", id: 409203825
mas "1Password 7", id: 1333542190
mas "Xcode", id: 497799835
mas "NextDNS", id: 1464122853
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "Slack", id: 803453959
