tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "caskroom/cask"
tap "homebrew/cask-fonts"
tap "superfly/brew"
tap "schniz/tap"
tap "heroku/brew"

# cat replacement https://github.com/sharkdp/bat
brew "bat"

# https://github.com/AlDanial/cloc
brew "cloc"
brew "curl"

# https://github.com/so-fancy/diff-so-fancy
brew "dockutil"
brew "diff-so-fancy"

# ls replacement https://github.com/ogham/exa
brew "exa"

# command line fuzzy-finder https://github.com/junegunn/fzf
brew "fzf"

# Find replacement https://github.com/sharkdp/fd
brew "fd"

# https://github.com/cli/cli
brew "gh"

brew "highlight"
brew "hub"

# https://github.com/ios-control/ios-deploy
# brew "ios-deploy"
brew "jq"

# https://github.com/jesseduffield/lazydocker
brew "lazydocker"

# https://github.com/jesseduffield/lazygit
brew "lazygit"

# https://github.com/mas-cli/mas
brew "mas"

# https://github.com/dylanaraps/neofetch
brew "neofetch"
brew "neovim"
brew "python"

# https://github.com/madler/pigz
brew "pigz"

# https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard
# no longer needed for tmux 2.6 but just in case
# brew "reattach-to-user-namespace"

# https://github.com/BurntSushi/ripgrep
brew "ripgrep"

# fast node manager
brew "schniz/tap/fnm"

# https://github.com/koalaman/shellcheck
brew "shellcheck"

# https://github.com/superfly/fly
brew "superfly/brew/fly"

# sed replacemnet https://github.com/chmln/sd
brew "sd"

# copy ssh keys to servers
# https://www.ssh.com/ssh/copy-id
brew "ssh-copy-id"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"

brew "vim"
brew "watchman"

# Spoof MAC Address
cask "wifispoof"
brew "wget", args: ["with-iri"]
brew "wifi-password"
brew "yarn", args: ["ignore-dependencies"]
brew "yarn-completion"

brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-completions"

cask "alfred"
cask "discord"
cask "kitty"
cask "flux"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-iosevka"
cask "font-iosevka-nerd-font"

# MacOS Automation Tool https://www.hammerspoon.org/
cask "hammerspoon"
cask "firefox"

cask "charles"
# chrome without the tracking
cask "chromium"
cask "cleanmymac"
cask "imageoptim"
cask "licecap"
cask "little-snitch"
cask "focus"
cask "flux"
cask "macvim"
cask "micro-snitch"
cask "notion"
cask "polymail"
cask "postico"
cask "postman"
cask "postgres"
cask "slack"
cask "sublime-text"
cask "spotify"
cask "sketch"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
cask "zeplin"

mas "Xcode", id: 497799835
mas "1Password", id: 443987910
mas "NextDNS", id: 1464122853
